Repository: ryu-75/Piscine-Django
Catalog: Django_3/Final/d09/d09/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Register
fr: S'inscrire

source: Logged as
fr: Connecté en tant que

source: Log out
fr: Déconnexion

source: Log in
fr: Connexion

source: %(username)s has left the chat
fr: %(username)s a quitté le chat

source: Room '%(room_name)s' has been deleted by %(username)s
fr: La conversation '%(room_name)s' a été supprimée par %(username)s

source: You are not authorized to delete this room
fr: Vous n\'êtes pas autorisé à supprimer cette conversation

source: Welcome to eChat
fr: Bienvenue sur eChat

source: Welcome to the chat
fr: Bienvenue dans le chat

source: Select a room to start chatting.
fr: Sélectionnez une room pour commencer à chatter.

source: Send
fr: Envoyer

source: Type your message...
fr: Tapez votre message...

source: Chat connection closed
fr: Connexion au chat fermée

source: This room has been deleted
fr: Cette room a été supprimée

source: You will be redirected to the main page...
fr: Vous allez être redirigé vers la page principale...

source: Back to home
fr: Retour au menu principal

source: You are no longer a member of this room or the room no longer exists.
fr: Vous n\'êtes plus membre de cette room ou la room n\'existe plus.

source: Rooms
fr: Salons

source: Create Room
fr: Créer un salon

source: Join a room...
fr: Rejoindre un salon...

source: Leave
fr: Quitter

source: Delete
fr: Supprimer

source: No rooms joined
fr: Aucun salon rejoint

source: Are you sure you want to leave this room?
fr: Êtes-vous sûr de vouloir quitter cette conversation?

source: Are you sure you want to delete this room? This action is irreversible.
fr: Êtes-vous sûr de vouloir supprimer cette conversation? Cette action est irréversible.

source: Room name to create?
fr: Nom de la conversation?

source: Connected Users
fr: Utilisateurs connectés

source: Online
fr: En ligne

source: No users connected
fr: Aucun utilisateur connecté

source: %(username)s has joined the chat
fr: %(username)s a rejoint le chat
